Revit 2027 API
TargetHostEdgeAndTransform Methods
The TargetHostEdgeAndTransform type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetHostEdgeTransform |  Gets the transform that is associated to the host edge's geometry.
GetTargetHostEdge |  Gets the target host edge.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
TargetHostEdgeAndTransform Class
Autodesk.Revit.DB.Structure Namespace